backend/tests/load/ingestion-load.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up to 50 req/s
  defaults:
    headers:
      x-github-event: "workflow_run"
      x-hub-signature-256: "sha256=dummy_signature"
      x-bypass-signature: "true"
scenarios:
  - name: "GitHub Webhook Delivery"
    flow:
      - post:
          url: "/webhooks/github"
          json:
            action: "requested"
            workflow_run:
              id: "{{ $randomNumber(1000000, 9999999) }}"
              status: "queued"
              created_at: "2026-01-27T23:54:20Z"
              name: "CI Build"
            repository:
              full_name: "Grisolfi/test-repo"
          headers:
            x-github-delivery: "{{ $uuid }}"